# Taps
tap 'homebrew/bundle'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'jlhonora/lsusb'

# For installing GUI applications
tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'caskroom/cask/brew-cask'

# Version Control
brew 'git'

# Java stuff
cask 'java7'
brew 'ivy'
brew 'ant'

# Make stuff
brew 'pkg-config'
brew 'autoconf'
brew 'automake'
brew 'readline'

# Fish shell
brew 'fish'

# Programming Languages
brew 'python'
brew 'node'
brew 'go'

# System Administration
brew 'htop-osx'

# For better piping
brew 'pv'

# Stuff missing from Linux
brew 'xz'
brew 'jlhonora/lsusb/lsusb'

# Networking tools
brew 'nmap'
cask 'istumbler'

# Xorg from Apple
cask 'xquartz'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Awesome Markdown editor
cask 'mou'

# The best text editor
cask 'sublime-text3'

# Reverse Engineering tools
cask 'hopper-disassembler'
cask '0xed'

# Miscelaneous
brew 'keybase'
brew 'youtube-dl'
cask 'dropbox'
cask 'gfxcardstatus'
cask 'github'
cask 'mplayerx'
cask 'skype'
cask 'teamviewer'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'virtualbox'
